Repository: giellalt/corpus-sme
Catalog: tmx/nob/admin/sd/white_papers/gievrras_giellamodeallat.pdf.tmx
Source language: sme
Languages: nob

source: Sámegiela sosiolingvistihkalaš dilit leat goittotge jámma rievdan ja šaddan eambbo hástaleaddjin.
nob: De sosiolingvistiske forholdene i samisk har likevel stadig endret seg og blitt mer utfordrende.

source: Maiddái nanu sámegielat guovlluin mánnájoavkkuide leat šaddan ain eambbo mánát, geat eai máhte sámegiela produktiivvalaččat dahje oppanassiige, dahje geain lea eará sivaid dihte nanu tendeansa válljet riikkagiela.
nob: Også i sterke samiskspråklige områder har det i barnekullene blitt flere barn som ikke har et produktivt samisk språk eller som ikke kan samisk i det hele tatt, eller som av andre grunner har en tendens til å velge riksspråket.

source: Dakkár diliide eai leat álo nagodan reageret sámegielat mánáidgárddiin ja skuvllain.
nob: I samisktalende barnehager og i skolen har man ikke alltid klart å reagere på slike forhold.

source: Giellafálaldagas leat dávjá váilon gielladiđolaš geavadiid dehálaš oasit: doaimmaid gielalaš plánen, systemáhtalaš giellaválljen mánáiguin, giellabirrasa stivren ja barggu bohtosiid čuovvuleapmi ja árvvoštallan.
nob: I språktilbudet har ofte viktige deler av bevisste språkpraksiser manglet: språklig planlegging av aktiviteter, systematisk språkvalg sammen med barna og oppfølging og evaluering av språkarbeidets resultater.

source: Go bargiin eai leat álo leamaš návccat vuhtiiváldit ja doarjut heterogenalaš mánnájoavkku buot dárbbuid, sii leat álkit geavahišgoahtán riikkagiela veahkkegiellan .
nob: Siden de ansatte ikke alltid har hatt kapasitet til å følge opp og støtte ulike språkbehov i heterogene barnegrupper, har det vært lettere for dem å ta riksspråket i bruk som hjelpespråk .

source: Boađus lea dalle dávjá, ahte riikkagielat mánát eai oahpa sámegiela doarvái, ja sámegielat mánáid sámegielat biras hedjona.
nob: Resultatet er ofte at de riksspråklige barna ikke lærer samisk tilstrekkelig, og det samisktalende miljøet til de samisktalende barna blir svakere.

source: Lea diehttelas ja hui mávssolaš ahte máŋga čeahpes mánáidgárdebargi ja oahpaheaddji miehtá Sámi leat máhttán bargat gielladiđolaččat ja systemáhtalaččat, muhto čuolbma leage dat, ahte nannenmodealla ollašuvvan lea leamaš menddo sakka ovttaskas bargiid duohkin .
nob: Selvfølgelig har mange dyktige barnehageansatte og lærere i hele Sápmi jobbet språkrettet og systematisk, dette har vært svært viktig, men problemet er at realiseringen av befestningsmodellen har vært altfor avhengig av den enkelte ansatte .

source: Institušuvnnalaš dásis nannenmodealla lea doaibman buoremusat Suoma beal Sámis, gos sámegielat birrasa huksemii ja diđolaš giellageavadiidda lea giddejuvvon ollu fuomášupmi.
nob: På institusjonelt nivå har befestningsmodellen fungert best på finsk side av Sápmi, der oppbygning av samiskspråklige miljøer og bevisste språkpraksiser har fått stor oppmerksomhet.

source: Lea omd. diehttelas, ahte sámegielat mánnájoavkkuin bargit eai geavat eisige suomagiela.
nob: Det er f.eks. en selvfølge at de ansatte ikke bruker finsk i det hele tatt i samiskspråklige barnegrupper.

source: Doaimmat leat vuogáiduvvan ásahusaid dásis: dain lea joatkevašvuohta olles mánáidgárde- ja skuvlaáigodaga bokte, lea bissovaš 17 ruhtadeapmi ja muhtun muddui gielladiđolaš plánen ja bohtosiid čuovvuleapmi.
nob: Dette er institusjonalisert: de har kontinuitet gjennom hele barnehage- og skoleperioden, fast finansiering og til en viss grad språkbevisst planlegging og oppfølging av resultatene.

source: Dieđusge maiddái Suoma bealde bargui laktásit ollu hástalusat.
nob: Selvsagt knytter det seg mange utfordringer også til arbeidet på finsk side.

source: Nannenmodealla ovdánahttin ja sajáidahttin institušuvnnalaš dásis olles Sámis lea hui dehálaš sámegielat mánáid ja bearrašiid giellarivttiid geahččanguovllus ja olles sámegielaid boahttevuođa dihte.
nob: Utviklingen og realiseringen av befestningsmodellen på institusjonsnivå i hele Sápmi er meget viktig utfra de samisktalende barnas og familiers språkrettighetsperspektiv og for framtiden til alle samiske språk .

source: 7 Gievrras giellamodeallaid organisatoralaš bealit
nob: 14 7 Organisatoriske sider ved sterke språkmodeller

source: Dokumeanttas Gievrras giellamodeallat I: duogáš ja definišuvnnat čájeheimmet movt gievrras giellamodeallaid meroštallamis leat guokte beali, vuosttažin organisatoralaš bealli ja nubbin diđolaš giellageavadat .
nob: I dokumentet Sterke språkmodeller I: bakgrunn og definisjoner viste vi hvordan definisjonen av sterke språkmodeller har to sider, de organisatoriske forutsetningene på den ene siden og bevisste språkpraksiser på den andre.

source: Gievrras giellamodeallaid gielalaš ulbmil lea sirdit mánáide sámegiela produktiivvalaš giellan.
nob: Det språklige målet med sterke språkmodeller er å overføre samisk som produktivt språk til barna.

source: Organisatoralaš beliid ferte láhčit dán ulbmila olaheami hárrái, ja ovddasvástádus lea giellafálaldaga eaiggádis dahjege ásaheaddjis.
nob: De organisatoriske sidene må tilrettelegges slik at dette målet kan nås, og ansvaret ligger på eieren eller tilbyderen av språktilbudet.

source: Dán vuollelogus mii guorahallat gievrras giellamodeallaid ollašuhttima organisatoralaš beliid.
nob: I dette kapittelet ser vi på de organisatoriske sidene ved gjennomføringen av sterke språkmodeller.

source: 7.1 Eaiggátrolla: giellafálaldaga lágideaddji ollislaš ovddasvástádus
nob: 7.1 Eierrollen: tilbyders helhetlige ansvar

source: Buot giellafálaldagain gávdno dihto hálddašeaddji dahje eaiggát, mas lea ovddasvástádus fálaldaga iešguđet beliin.
nob: Alle språktilbud har visse forvaltere eller eiere som har ansvar for de forskjellige sidene ved tilbudet.

source: Dákkár hálddašeaddji sáhttá ovdamearkka dihte leat gielda, sámi ásahus dahje organisašuvdna, dahje dego Ruoŧas, Sámeskuvlastivra.
nob: En slik forvalter kan være kommunen, den samiske institusjonen eller organisasjonene, eller som i Sverige, Sameskolestyrelsen.

source: Sámegielat fálaldagaid lihkostuvvama dihte lea áibbas guovddážis dat, ahte bargu plánejuvvo, čuovvuluvvo ja ovdánahttojuvvo institušuvnnalaš ja struktuvrralaš dásis, ja ahte doaimmaid lágideamis lea ollislaš ovddasvástádus .
nob: For å kunne lykkes med samiskspråklige tilbud, er det helt sentralt at arbeidet planlegges, oppfølges og utvikles på institusjonelt og strukturelt nivå, og at noen har det helhetlige ansvaret for tilretteleggingen av aktivitetene .

source: Dálá dilis okta sámegielat mánáidgárde- ja skuvladoaimmaid stuorámus čuolmmain lea dat, ahte áibbas menddo ollu lea ovttaskas bargiid ja váhnemiid duohken.
nob: I dagens situasjon er ett av de største problemene ved samiskspråklige barnehage- og skoletilbud at altfor mye er opp til de enkelte ansatte og foreldre.

source: Go suohkanat dahje eará eaiggádat álggahit dahje fállet sámegiel fálaldagaid juogo mánáidgárddis dehe skuvllas, de vuosttaš lávki lea dat mii lea jo ovddabealde namuhuvvon: sii galget dovdat guovllu ja mánnájoavkkuid gielladiliid bures.
nob: Når kommunene eller andre eiere igangsetter eller tilbyr samiskspråklige tilbud enten i barnehagen eller i skolen, er første steg det som allerede er nevnt foran: de må kjenne språksituasjonen i området og til barnegruppene godt.

source: Gielladoaimmaid lágideddjiide berre leat čielga vuordámuš ahte mánát ožžot dan gievrramus fálaldaga maid lágideaddji nagoda fállat.
nob: Neste steg er å kartlegge hvilke tilbud de kan gi med de eksisterende ressursene, og hva som er den sterkeste modellen de kan tilby.

source: Gielddain ja eará eaiggádiin ferte gávdnot ollislaš giellaplána mánáid sámegielat giellabálgá várás.
nob: Det bør være klare forventninger til at barna får den sterkeste modellen som tilbyder kan tilby.

source: Doaba giellabálggis govvida olbmo giellabirrasiid joatkevašvuođa, giellafálaldagaid bisttu ja ollisvuođa.
nob: Begrepet språk løp beskriver kontinuiteten, varigheten og helheten av språktilbudene i menneskets språkmiljø.

source: Máná almmolaš giellabálggis galggašii álgit mánáidgárddi rájes ja de joatkit skuvlamannolagas, olles vuođđooahpahusa loahpa 18 rádjái.
nob: Barnets offentlige språkløp burde starte fra barnehagen og fortsette gjennom skoleløpet, helt til endt grunnopplæring.

source: Das ferte váldit vuhtii ruovttugiellan sámegiela hálli mánáid ja riikkagielat mánáid;
nob: Der må man ta hensyn til de barna som har samisk som hjemmespråk og de riksspråklige barna;

source: iešguđetge muttuid goas mánná šaddá sámegielat birrasii (mánáidgárdi, skuvla).
nob: altså forskjellene i tidspunktet for barnas inntreden i samiskspråklige miljøer (barnehage, skole).

source: Ferte leat vuolggasadjin dat, ahte sámegielat bálggis huksejuvvo ja fállojuvvo mánáidgárddi álggu rájis gitta skuvlaagi lohppii .
nob: Utgangspunktet må være at det samiskspråklige løpet etableres og tilbys fra starten i barnehagen til slutten av skolealderen .

source: Nannoseamos giellabálggis lea go mánná oažžu sámegielat fálaldaga olles áiggi mánáidgárddis, vuođđooahpahusas ja joatkkaoahpus.
nob: Det sterkeste språkløpet har vi når barnet får et samiskspråklig tilbud hele tiden i barnehagen, i grunnopplæringen og i videregående opplæring.

source: Lea erenomáš dehálaš, ahte máná giella beassá ovdánit olles su mánnávuođa ja nuorravuođa čađa iige su gielladáidu bisán iige geahnohuva.
nob: Det er spesielt viktig at språket til barnet får utvikle seg gjennom hele barndommen og ungdommen og at språkferdigheten ikke stopper opp eller blir svekket.

source: Lea goittotge dađe bahábut hui dábálaš dálá diliin, ahte nu geavvá.
nob: I dag er det dessverre vanlig at situasjonen er slik at dette inntreffer.

source: Dat albmanus, go olbmo vuosttašgiela gielladáidu áiggi mielde geahnohuvvá, gohčoduvvo gielladiehtagis giellaattrišuvdnan (eŋg. ).
nob: Fenomenet der språkferdigheten i førstespråket svekkes med tiden, kalles i språkvitenskapen for språkattrisjon (eng. ).

source: Sámi mánáid hárrái vásihuvvo giellaattrišuvdna dan láhkái ahte mánás, geas lea sámegiella vuosttašgiellan, sámegiela dáidu geahnohuvvá dahje ii ovdán nu movt lunddolaččat livččii vuordimis vuosttašgielat olbmos.
nob: Hos samiske barn oppleves språkattrisjon som at den samiske språkferdigheten til barnet med samisk som førstespråk, svekkes eller ikke utvikles slik det ville ha vært naturlig å forvente hos førstespråklige barn.

source: Muhtin mánát geain vuosttašgiella lea sámegiella, sáhttet njuolgut heaitit sámásteames, ja sin gielladáidu geahnohuvvá nu ahte produktiiva sámegielat mánát šaddet reseptiiva sámegielagin.
nob: Noen barn med samisk som førstespråk kan rett og slett slutte å snakke samisk, og deres språkferdighet blir så svekket at tidligere produktivt samisktalende barn blir reseptivt samiskspråklige.

source: Jus mánát eai oba gulage eaige ane iežaset vuosttašgiela de dát sáhttá jávkat, go nubbi giella váldá vuosttašgiela saji.
nob: Dersom barna ikke hører sitt førstespråk i det hele tatt, eller ikke bruker det, kan det forsvinne, siden det andre språket overtar for førstespråket.

source: Giellaattrišuvdna dáhpáhuvvá go mánáid gielalaš biras rievdá nu ahte mánát gullet ja atnigohtet iežaset vuosttašgiela hárvvibut.
nob: Språkattrisjon inntreffer når barnas språklige miljø endrer seg slik at barna hører og bruker sitt førstespråk sjeldnere.

source: Dákkár giellabirasrievdamat dábálaččat dáhpáhuvvet go mánná álgá mánáidgárdái dahje skuvlii, ja dán fálaldagas máná sámegiella ii dorjojuvvo doarvái.
nob: Slike språkmiljøendringer inntreffer vanligvis når barnet begynner i barnehagen eller skolen, og barnets samiske språk ikke støttes tilstrekkelig i dette tilbudet.

source: Váhnemat vásihit mánáid giellaattrišuvnna duođalaš áššin.
nob: Foreldre opplever barns språkattrisjon som alvorlig.

source: Dan dihte bargojoavku lea válljen deattuhit giellafálaldagaid bisttu dahjege jotkkolašvuođa dehálaš fáktorin sámegiela seailluheamis ja nannemis mánáid produktiivvalaš giellan.
nob: Derfor har arbeidsgruppa valgt å vektlegge varigheten eller 15 kontinuiteten av språktilbudene som viktige faktorer i bevaringen og styrkingen av barnas produktive språk .

source: Bargojoavku háliida deattuhit dan, ahte buot sámeoahpahusa ektui lea hui dehálaš meroštallat čielga ovddasvástádusa oahpahusa lágideamis ja čuovvuleamis .
nob: Arbeidsgruppa ønsker å understreke at i forhold til all samiskundervisning er det meget viktig å definere et klart ansvarsforhold ved tilrettelegging og oppfølging av undervisningen .

source: Lea dábálaš ahte váhnemat šaddet guoddit ovddasvástádusa das álggahuvvogo sámegielat fálaldat, goas dat álggahuvvo, fidnego skuvla/mánáidgárdi sámegielat bargi ja gávdnojitgo sadjásaččat, jus bargi buohccá.
nob: Det er vanlig at foreldrene må bære ansvaret for om det igangsettes et samiskspråklig tilbud, for når det igangsettes, at skolen/barnehagen klarer å rekruttere samisktalende ansatte og om det finnes vikar dersom den ansatte blir syk.

source: Sámeoahpahusa ovddasvástádus ii sáhte goassige leat váhnemiid hálddus.
nob: Ansvaret for samiskundervisningen skal aldri ligge hos foreldrene .

source: Gielddat fertejit geahččat bearrái ahte sin vuogádagas lea ovddasvástádus sámegielat fálaldaga organisatoralaš beliin ja bohtosiin.
nob: Kommunene må se til at deres system har ansvaret for de organisatoriske sidene og resultatene av det samiskspråklige tilbudet.

source: Váhnemiin ferte leat čielga diehtu dan birra, geainna sii sáhttet guorahallat mánáid sámegielat fálaldaga čuolmmaid - sihke dan, jus mánná ii oaččo fálaldaga mii sutnje gullá, ja dan, jus sámegielat fálaldat ii doaimma nu movt galggašii, ee. mánná ii oahpa sámástit dahje su sámegiela dáidu hedjona.
nob: For foreldre må det være klart hvem de skal kontakte ved eventuelle utfordringer rundt barnas samiskspråklige tilbud – dersom barnet ikke får det tilbudet som det har rett til, og dersom det samiskspråklige tilbudet ikke fungerer slik det skal, blant annet dersom barnet ikke lærer å snakke samisk eller hvis samiskferdigheten svekkes.

source: Sámedikkiin berrešii leat bearráigeahččoortnet mii sihkkarastá ahte buot giellafálaldagat mat addojuvvojit gievrras giellamodeallaid vuogi mielde, duođasge lihkostuvvet sajáiduhttit sámegiela mánáide hupmangiellan.
nob: Sametingene burde ha en tilsynsordning som sikrer at alle språktilbudene som gis etter sterke språkmodeller, virkelig klarer å etablere samisk som barnas kommunikasjonsspråk.

source: Dákkár vuogádat 19 gáibida ahte muhtun ásahusas leat rávvagat movt dađistaga nannet sámegieloahpahusa- dehe fálaldaga vai dat buorrána.
nob: Et slikt system krever at noen institusjoner gir råd for hvordan man stadig kan styrke samiskundervisningen eller -tilbudet slik at det blir bedre.

source: Dát livččii Sámedikki doaibma.
nob: Dette burde være Sametingets oppgave.

source: Váidinvuogádaga ferte hukset nu, ahte váidin čujuha struktuvrraide, fálaldaga lágideaddjái - ii ovttaskas bargiide ja oahpaheddjiide.
nob: Klageinstansen burde bygges opp slik at klagen viser til strukturene, til tilbyderen – ikke til den enkelte ansatte eller lærer.

source: Seammás lea hui dehálaš váldit vuhtii ja nannet sámegielat bargiid buresveadjima, bargobirrasa, doarjaga ja gelbbolašvuođaloktema.
nob: Samtidig er det viktig å ta hensyn til og styrke velferden, arbeidsmiljøet, kompetansehevingen og støtten til den samisktalende ansatte .

source: Mii buohkat diehtit man garra deattuid vuolde ja vátni resurssaiguin sámegielat mánáidgárdebargit ja oahpaheaddjit barget.
nob: Vi vet alle hvor stort press de samisktalende barnehageansatte og lærere arbeider under, og hvor få ressurser de rår over.

source: Dakkár dilis ee. kritihkka váhnemiin sáhttá čuohcat hui lossadit ja persovnnalaččat ovttaskas bargiide, vaikko ovddasvástádus galggašii leat fálaldaga lágideaddjiin.
nob: I en slik situasjon vil blant annet kritikk fra foreldrene kunne ramme den enkelte ansatte veldig tungt og personlig, selv om ansvaret skulle ligge hos tilbyderen av tilbudet.

source: 7.2 Iešguđet doaibmavugiid namahusat
nob: 7.2 Betegnelse på de forskjellige språktilbudene

source: Miehtá Sámi mánáide lágiduvvon giellabirrasiid birra galget geavahuvvot systemáhtalaččat dihto doahpagat ja namahusat.
nob: Overalt i Sápmi skal det systematisk brukes bestemte begreper og betegnelser om språkmiljøer som er tilrettelagt for barn .

source: Doahpagat galget leat čielgasat ja čađačuovgit, nu ahte daid bokte juohkehaš ipmirda, makkár joavkku ja makkár doaimmaid birra lea sáhka. Dat lea dehálaš vuosttažettiin váhnemiid dáfus: sii galget beassat válljet máná bajásgeassin- ja oahpahusbirrasa buriin áddejumiin das, makkár gielalaš bohtosat leat vuordimis sin mánáid ektui guđege birrasis.
nob: Begrepene skal være klare og innlysende, slik at enhver kan forstå hvilken gruppe og hvilke tilbud det er snakk om. Dette er viktig spesielt i forhold til foreldrene: de skal kunne velge barnets oppvekst og undervisningsmiljø med god forståelse av hvilke språklige resultater man kan forvente for sine barn i de forskjellige tilbudene.

source: Nuppi dáfus dat lea hui dehálaš mánáidgárdedoaimmaid ja oahpahusa lágideaddji ja hálddašeaddji oainnus.
nob: Dette er også viktig for de som tilrettelegger og forvalter barnehagetilbudene og undervisningen.

source: Dat geas lea ovddasvástádus doaimmain, ferte čielgasit, jo namahusa dásis, buktit ovdan dan, makkár doaimmaid birra lea gažaldat. Galgá áddet, ahte dihto giellamodeallaiguin lea vejolaš ollet dihto bohtosiidda.
nob: Den som har ansvaret for språktilbudet skal gjøre det tydelig allerede på betegnelsesnivå hva slags tilbud det er snakk om. Det må være inneforstått at ved hjelp av bestemte språkmodeller er det mulig å oppnå bestemte resultater .

source: Doaibmavugiid namahusat ja doahpagat galget govvidit dan, makkár modealla lea geavahusas, mii lea sámegiela rolla doaimmain ja makkár bohtosiidda lea vejolaš ollet guđege doaimmain.
nob: Betegnelser på og begreper om språktilbud skal beskrive hvilken modell som anvendes, det samiske språkets rolle i tilbudet og hvilke resultater det er mulig å oppnå ved hjelp av de forskjellige tilbudene.

source: Sámi mánáidgárdi / sámi skuvla / sámeluohkká / sámeossodat: Dát doahpagat galget čujuhit dakkár mánáidgárde- ja skuvladoaimmaide, main sámegiella lea gulahallama ja oahpahusa váldogiella.
nob: Samisk barnehage / samisk skole / samisk klasse / samisk avdeling : Disse begrepene skal vise til barnehage- og skoletilbud der samisk er hovedspråket i kommunikasjonen og i undervisningen.

source: Sámi mánáidgárdi, -luohkká ja -ossodat galget lágiduvvot dušše gievrras giellamodealla bokte: geavahusas lea nannenmodealla dahje oamastanmodealla.
nob: Samisk barnehage, -klasse og -avdeling skal kun tilrettelegges etter sterke språkmodeller: i praksis betyr det etter befestningsmodellen eller tilegnelsesmodellen.

source: Jus geavahusas lea goaikkanasmodealla (gč. ovddit dokumeantta), ja sámegiella geavahuvvo duollet dálle dahje dušše oktan oahppofágan, de joavkku galggašii gohčodit eará láhkái.
nob: Dersom det er dryppmodellen som anvendes (se forrige dokument), og samisk brukes nå og da eller bare som et undervisningsfag, da burde man bruke et annet navn på gruppa.

source: Geavahusas lea dalle dat modealla, man bargojoavku lea gohčodan oamastanmodeallan.
nob: Språkbad kan man kalle et barnehage- eller skoletilbud der samisk er undervisnings- og kommunikasjonsspråket selv om det ikke er barnets hjemmespråk / førstespråk.

source: Mánát ohppet sámegiela praktihkas, doaimmaid bokte.
nob: Barna lærer seg samisk via praktiske aktiviteter.

source: Sii ožžot álggus ieža hupmat dan giela man máhttet, muhto sii sámástišgohtet dađi mielde go sii ohppet sámegiela.
nob: Til å begynne med får de snakke det språket som de kan, men de begynner å snakke samisk etter hvert som de lærer det.

source: Giellalávgumis ollašuhttojuvvo gielladiđolaš giellalávgunpedagogihkka.
nob: I språkbadet brukes språkbevisst språkbadspedagogikk.

source: Rávesolbmot veahkehit ja dorjot máná sámásteami ja 20 ovdánahttet dan iešguđetlágán pedagogalaš vugiiguin ja materiálaiguin.
nob: De voksne hjelper og støtter barna i bruken av samisk og utvikler det samiske språket ved hjelp av forskjellige 16 pedagogiske metoder og materialer.

source: Ulbmil lea dat, ahte mánná hállagoahtá giela produktiivvalaččat.
nob: Målet er at barnet begynner å snakke språket produktivt.

source: Riikkagiella ii galgga hubmojuvvot mánáiguin iige dat geavahuvvo doarjjagiellan.
nob: Man skal ikke snakke riksspråket med barna og det skal heller ikke brukes som støttespråk.

source: Vuollel skuvlaahkásaččaid giellalávgun lea árat giellalávgun ja skuvllaagis álgán giellalávgun maŋit giellalávgun .
nob: Språkbad for de som er under skolealder, er tidlig språkba d og språkbad som er påbegynt i skolealder, er senere språkbad .

source: Gievrramus giellalávgunmálle lea dievaslaš giellalávgun , gos buot doaimmat ollašuvvet sámegillii.
nob: Den sterkeste språkbadmodellen er fullstendig språkbad , der alle aktivitetene utføres på samisk.

source: Jus oassi doaimmain lea sámegillii ja oassi riikkagillii, gažaldagas lea oasseáigásaš giellalávgun .
nob: Dersom en del av aktivitetene er på samisk og en del på riksspråket, så er det snakk om delvis språkbad .

source: Dat ii leat seammá beaktil go dievaslaš giellalávgun, iige das sáhte vuordit seammá buriid gielalaš bohtosiid.
nob: Det er ikke like effektivt som fullstendig språkbad og man kan heller ikke forvente de samme gode resultatene.

source: Oasseáigásaš giellalávgumis sámegiela oassi galgá leat unnimustá 50 % buot doaimmain, muđuid doaimmat eai deavdde giellalávguma kriteraid.
nob: I delvis språkbad skal samisk utgjøre minst 50 % av alle aktivitetene, ellers vil ikke aktivitetene dekke kriteriet for språkbad.

source: Giellabeassi lea árat, dievaslaš giellalávgun mánáidgárddis eamiálbmoga dahje unnitlogu gillii.
nob: Språkreir er tidlig, fullstendig språkbad i barnehagen på urfolkets eller minoritetens språk.

source: Dakkár joavku doaibmá nappo oamastanmodealla mielde.
nob: En slik gruppe fungerer altså etter tilegnelsesmodellen.

source: Mánát bohtet giellabeassái dan agis go dárbbašit mánáidgárdesaji, ja sidjiide hubmojuvvo giellabeasis duššebeare sámegiella álggu rájes.
nob: Barna kommer til språkreiret i den alderen der de trenger barnehageplass, og i språkreiret blir det kun snakket samisk til dem helt fra begynnelsen av.

source: Giellabeassi galgá leat ollislaš, searvvušlaš giellaealáskahttima oassin, bearrašiid ja servoša čatnašupmi doaimmaide lea guovddážis.
nob: Språkreiret skal være del av en helhetlig, samfunnsmessig språkvitalisering, der familienes og samfunnets tilknytning til aktivitetene står sentralt.

source: Dat galgá álggahit ođđasis giela sirdáseami sohkabuolvvas nubbái dakkár sosiolingvistihkalaš dilis go máŋgasat leat massán sámegiela bearrašiin.
nob: Det skal sette i gang en ny overføring av språket fra generasjon til generasjon i en slik sosiolingvistisk situasjon der mange har mistet det samiske språket i familien.

source: Giellabeasi maŋŋá mánáin galggašii leat vejolašvuohta beassat sámegielat skuvlaoahpahussii.
nob: Etter språkreiret skal det være mulig for barna å få samiskspråklig skoleundervisning.

source: Ovddabealde namuhuvvon doahpagat geavahuvvojit dálá áiggi dávjá boastut: dakkár doaimmat ja joavkkut, mat eai deavdde omd. giellalávguma kriteraid, gohčoduvvojit giellalávgumin.
nob: De nevnte begrepene brukes ofte feil i dag: grupper som ikke oppfyller kriteriene for eksempelvis språkbad, kalles for språkbad.

source: Erenoamáš čuolbma dat lea leamaš giellabeassidoahpagiin, mii lea váldojuvvon muhtun sajiin geavahussii ee. oktii vahkus lágiduvvon giellabottuid olis.
nob: Det har vært et spesielt problem knyttet til begrepet språkreir som noen steder er tatt i bruk om blant annet språkstunder som arrangeres en gang i uka.
